app/Controllers/Home.php

    public function index()
    {
        $dbPrimary   = Database::connect('default');
        //inicializamos instancia de nuestro modelo
        $userModel = new UserModel($dbPrimary);
        //vamos a buscar un usuario
        $user=$userModel->find('1');
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'